Tekla Open API Reference for Tekla Structures 2025
Reinforcement.InputPointDeformingState Property
 Gets or sets the reinforcement input point deforming state.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DeformingType InputPointDeformingState { get; set; }
Public Property InputPointDeformingState As DeformingType
	Get
	Set
Property Value
Type: DeformingType
See Also
Reference
Reinforcement Class
Tekla.Structures.Model Namespace